---
kind: method
id: M:Autodesk.Revit.DB.LevelAssociationData.SetAssociatedLevel(Autodesk.Revit.DB.ElementId)
source: html/f9070334-e889-1686-fad3-ba2a9bf7a2d7.htm
---
# Autodesk.Revit.DB.LevelAssociationData.SetAssociatedLevel Method

Sets the Associated Level.

## Syntax (C#)
```csharp
public void SetAssociatedLevel(
	ElementId levelId
)
```

## Parameters
- **levelId** (`Autodesk.Revit.DB.ElementId`) - The id of the Level.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null
- **Autodesk.Revit.Exceptions.InvalidOperationException** - this operation failed.